{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "81aeca17",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "470bb91d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record count(n)=63195>]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\"))\n",
    "\n",
    "def run(q, **params):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(q, **params)\n",
    "        return list(result)\n",
    "\n",
    "run(\"MATCH (n) RETURN count(n) LIMIT 100;\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "8b068fa8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record r=<Node element_id='4:2840ccb1-742e-468c-9306-07b4a1d7b0d3:0' labels=frozenset({'Recipe'}) properties={'difficulty': '초급', 'time_min': 120, 'servings': 2, 'recipe_id': 7016813, 'image_url': 'https://recipe1.ezmember.co.kr/cache/recipe/2024/01/01/cde5869c3bbfef2378fdd31b25a67cb11.jpg', 'full_text': '멸치육수 소고기 떡국 만드는법\\n소고기떡국\\n새해가 되면 뜨끈한 떡국 한 그릇이 생각나는데요. 오늘은 집에서 간단하게 요리할 수 있는 멸치육수로 끓이는법을 준비했어요.\\n[재료] 떡국떡\\x07400\\x07g\\x07| 다진소고기\\x07100\\x07g\\x07| 멸치육수\\x07800\\x07ml\\x07| 대파\\x071/3\\x07대\\x07| 계란\\x072\\x07개\\x07| 참기름\\x071\\x07T\\x07| 국간장\\x071\\x07T\\x07| 참기름\\x071/2\\x07T\\x07| 다진마늘\\x071\\x07t\\x07| 소금\\x07\\x07\\x07| 김가루\\x07\\x07약간\\x07', 'intro': '새해가 되면 뜨끈한 떡국 한 그릇이 생각나는데요. 오늘은 집에서 간단하게 요리할 수 있는 멸치육수로 끓이는법을 준비했어요.', 'name': '소고기떡국', 'title': '멸치육수 소고기 떡국 만드는법', 'views': 743}>>]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)\n",
    "RETURN r\n",
    "LIMIT 1;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "e4b1b84a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record label=['Recipe'] total=23192>,\n",
       " <Record label=['Ingredient'] total=5413>,\n",
       " <Record label=['Category'] total=27>,\n",
       " <Record label=['Method'] total=14>,\n",
       " <Record label=['Situation'] total=13>]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run(\"MATCH (n) RETURN labels(n) AS label, count(*) AS total ORDER BY total DESC;\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "4c656a0f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record count(r)=280843>]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run(\"MATCH ()-[r]->() RETURN count(r);\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "cb896693",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record rel_type='HAS_INGREDIENT' total=199160>,\n",
       " <Record rel_type='IN_CATEGORY' total=35299>,\n",
       " <Record rel_type='COOKED_BY' total=23192>,\n",
       " <Record rel_type='FOR_SITUATION' total=23192>]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH ()-[r]->() \n",
    "RETURN type(r) AS rel_type, count(*) AS total\n",
    "ORDER BY total DESC;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "0aba4a0a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record r.recipe_id=7016813 r.title='멸치육수 소고기 떡국 만드는법' r.name='소고기떡국' r.views=743 r.time_min=120>,\n",
       " <Record r.recipe_id=7016814 r.title='#수육용삼겹살 #된장수육만들기 #일상먹거리 #무생채와함께먹는된장수육' r.name='된장수육' r.views=1396 r.time_min=120>,\n",
       " <Record r.recipe_id=7016815 r.title='우거지감자탕 뼈해장국 끓이는법' r.name='우거지감자탕' r.views=4008 r.time_min=120>,\n",
       " <Record r.recipe_id=7016816 r.title='만두전골 레시피 백종원 만두 전골요리 뜨끈하고 진한 국물이 일품' r.name='만두전골' r.views=6350 r.time_min=60>,\n",
       " <Record r.recipe_id=7016817 r.title='새해 통삼겹살 무수분 보쌈 삶는법 백종원 보쌈 마늘소스 만들기' r.name='무수분보쌈' r.views=1829 r.time_min=90>]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)\n",
    "RETURN r.recipe_id, r.title, r.name, r.views, r.time_min\n",
    "LIMIT 5;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "34137032",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>,\n",
       " <Record r.time_min=5>]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)\n",
    "RETURN r.time_min\n",
    "ORDER BY r.time_min ASC\n",
    "LIMIT 20;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "6a3c1694",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record r.title='멸치육수 소고기 떡국 만드는법' ingredients=[\"'다진마늘'\", \"'국간장'\", \"'다진소고기'\", \"'소금'\", \"'계란'\", \"'대파'\", \"'멸치육수'\", \"'김가루'\", \"'참기름'\", \"'소고기'\"]>]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe {recipe_id: 7016813})\n",
    "OPTIONAL MATCH (r)-[:HAS_INGREDIENT]->(i:Ingredient)\n",
    "RETURN r.title, collect(i.name) AS ingredients;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c1576915",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record ingredient=\"'채소류'\" cnt=7636>,\n",
       " <Record ingredient=\"'소금'\" cnt=6849>,\n",
       " <Record ingredient=\"'설탕'\" cnt=6393>,\n",
       " <Record ingredient=\"'양파'\" cnt=6348>,\n",
       " <Record ingredient=\"'대파'\" cnt=6033>,\n",
       " <Record ingredient=\"'참기름'\" cnt=5975>,\n",
       " <Record ingredient=\"'물'\" cnt=5934>,\n",
       " <Record ingredient=\"'다진마늘'\" cnt=5197>,\n",
       " <Record ingredient=\"'후추'\" cnt=4338>,\n",
       " <Record ingredient=\"'통깨'\" cnt=4015>,\n",
       " <Record ingredient=\"'고춧가루'\" cnt=3760>,\n",
       " <Record ingredient=\"'식용유'\" cnt=3306>,\n",
       " <Record ingredient=\"'청양고추'\" cnt=3029>,\n",
       " <Record ingredient=\"'맛술'\" cnt=2662>,\n",
       " <Record ingredient=\"'당근'\" cnt=2614>,\n",
       " <Record ingredient=\"'계란'\" cnt=2483>,\n",
       " <Record ingredient=\"'간장'\" cnt=2425>,\n",
       " <Record ingredient=\"'기타'\" cnt=2425>,\n",
       " <Record ingredient=\"'식초'\" cnt=2384>,\n",
       " <Record ingredient=\"'진간장'\" cnt=2366>]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:HAS_INGREDIENT]->(i:Ingredient)\n",
    "RETURN i.name AS ingredient, count(*) AS cnt\n",
    "ORDER BY cnt DESC\n",
    "LIMIT 20;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "acad0b86",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record c.name=\"'밑반찬'\" cnt=5025>,\n",
       " <Record c.name=\"'메인반찬'\" cnt=4276>,\n",
       " <Record c.name=\"'밥'\" cnt=2721>,\n",
       " <Record c.name=\"'죽'\" cnt=2721>,\n",
       " <Record c.name=\"'떡'\" cnt=2721>,\n",
       " <Record c.name=\"'국'\" cnt=2193>,\n",
       " <Record c.name=\"'탕'\" cnt=2193>,\n",
       " <Record c.name=\"'기타'\" cnt=1424>,\n",
       " <Record c.name=\"'면'\" cnt=1334>,\n",
       " <Record c.name=\"'만두'\" cnt=1334>,\n",
       " <Record c.name=\"'디저트'\" cnt=943>,\n",
       " <Record c.name=\"'빵'\" cnt=869>,\n",
       " <Record c.name=\"'찌개'\" cnt=798>,\n",
       " <Record c.name=\"'샐러드'\" cnt=740>,\n",
       " <Record c.name=\"'차'\" cnt=667>,\n",
       " <Record c.name=\"'음료'\" cnt=667>,\n",
       " <Record c.name=\"'술'\" cnt=667>,\n",
       " <Record c.name=\"'김치'\" cnt=610>,\n",
       " <Record c.name=\"'젓갈'\" cnt=610>,\n",
       " <Record c.name=\"'장류'\" cnt=610>,\n",
       " <Record c.name=\"'양식'\" cnt=553>,\n",
       " <Record c.name=\"'퓨전'\" cnt=416>,\n",
       " <Record c.name=\"'양념'\" cnt=292>,\n",
       " <Record c.name=\"'소스'\" cnt=292>,\n",
       " <Record c.name=\"'잼'\" cnt=292>,\n",
       " <Record c.name=\"'과자'\" cnt=205>,\n",
       " <Record c.name=\"'스프'\" cnt=126>]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:IN_CATEGORY]->(c:Category)\n",
    "RETURN c.name, count(*) AS cnt\n",
    "ORDER BY cnt DESC;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "a67ebe0a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record m.name='끓이기' cnt=4882>,\n",
       " <Record m.name='볶음' cnt=4399>,\n",
       " <Record m.name='기타' cnt=3083>,\n",
       " <Record m.name='무침' cnt=2746>,\n",
       " <Record m.name='굽기' cnt=2300>,\n",
       " <Record m.name='부침' cnt=1538>,\n",
       " <Record m.name='조림' cnt=1186>,\n",
       " <Record m.name='찜' cnt=812>,\n",
       " <Record m.name='비빔' cnt=590>,\n",
       " <Record m.name='절임' cnt=541>,\n",
       " <Record m.name='튀김' cnt=465>,\n",
       " <Record m.name='삶기' cnt=426>,\n",
       " <Record m.name='데치기' cnt=177>,\n",
       " <Record m.name='회' cnt=47>]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:COOKED_BY]->(m:Method)\n",
    "RETURN m.name, count(*) AS cnt\n",
    "ORDER BY cnt DESC;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "be5ff459",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record s.name='일상' cnt=14378>,\n",
       " <Record s.name='간식' cnt=1978>,\n",
       " <Record s.name='초스피드' cnt=1648>,\n",
       " <Record s.name='다이어트' cnt=1042>,\n",
       " <Record s.name='술안주' cnt=919>,\n",
       " <Record s.name='영양식' cnt=863>,\n",
       " <Record s.name='손님접대' cnt=752>,\n",
       " <Record s.name='도시락' cnt=448>,\n",
       " <Record s.name='기타' cnt=407>,\n",
       " <Record s.name='명절' cnt=402>,\n",
       " <Record s.name='이유식' cnt=168>,\n",
       " <Record s.name='해장' cnt=109>,\n",
       " <Record s.name='야식' cnt=78>]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:FOR_SITUATION]->(s:Situation)\n",
    "RETURN s.name, count(*) AS cnt\n",
    "ORDER BY cnt DESC;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "582bf77c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:IN_CATEGORY]->(c:Category {name: '국'})\n",
    "RETURN r.title, r.recipe_id\n",
    "LIMIT 10;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "b495bf8b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:HAS_INGREDIENT]->(:Ingredient {name: '대파'})\n",
    "RETURN r.title, r.time_min\n",
    "LIMIT 10;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "10bc9d49",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:HAS_INGREDIENT]->(:Ingredient {name: '대파'})\n",
    "WHERE NOT EXISTS {\n",
    "  MATCH (r)-[:HAS_INGREDIENT]->(:Ingredient {name: '마늘'})\n",
    "}\n",
    "RETURN r.title, r.time_min\n",
    "LIMIT 10;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "cb79f35c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record r.title='칼칼한 고추장두부찌개' r.time_min=30>,\n",
       " <Record r.title='묵밥 만드는 법 온묵밥 만들기 도토리묵사발 육수 레시피 도토리묵 요리' r.time_min=120>,\n",
       " <Record r.title='양파 떡볶이 만들기 /달콤한 초간단 밀떡볶이 레시피' r.time_min=120>,\n",
       " <Record r.title='맑은 소고기무국 끓이는 법 아기 무국 레시피' r.time_min=90>,\n",
       " <Record r.title='감자 에그샐러드 만들기 베이컨 모닝빵 샌드위치' r.time_min=120>,\n",
       " <Record r.title='계란국 끓이는법 초간단 아기 순두부' r.time_min=15>,\n",
       " <Record r.title='돼지고기 목살 김치찌개 초간단 레시피 ' r.time_min=30>,\n",
       " <Record r.title='불고기솥밥' r.time_min=60>,\n",
       " <Record r.title='소세지카레 레시피' r.time_min=15>,\n",
       " <Record r.title='아기 새우죽 만들기 간단 유아식 레시피' r.time_min=15>]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:COOKED_BY]->(:Method {name:'끓이기'})\n",
    "WHERE NOT EXISTS {\n",
    "  MATCH (r)-[:HAS_INGREDIENT]->(:Ingredient {name:'돼지고기'})\n",
    "}\n",
    "RETURN r.title, r.time_min\n",
    "LIMIT 10;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "2054729e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record count(i)=5413>]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (i:Ingredient) RETURN count(i);''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "fc813e49",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record count(r)=199160>]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (:Recipe)-[r:HAS_INGREDIENT]->() RETURN count(r);''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "3d3cf3dd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record r.title='소고기 고추장볶음 레시피' collect(i.name)=[\"'소고기'\", \"'참기름'\", \"'다진마늘'\", \"'고추장'\", \"'물'\", \"'맛술'\", \"'설탕'\", \"'꿀'\", \"'통깨'\", \"'식용유'\"]>,\n",
       " <Record r.title='맑은 소고기무국 끓이는 법 아기 무국 레시피' collect(i.name)=[\"'소고기'\", \"'참기름'\", \"'대파'\", \"'국간장'\", \"'다진마늘'\", \"'물'\", \"'후추'\", \"'참치액'\", \"'무우'\"]>,\n",
       " <Record r.title='소고기장조림' collect(i.name)=[\"'소고기'\", \"'소고기'\", \"'소고기'\", \"'대파'\", \"'대파'\", \"'국간장'\", \"'양파'\", \"'양파'\", \"'청양고추'\", \"'청양고추'\", \"'청양고추'\", \"'간장'\", \"'간장'\", \"'홍고추'\", \"'물'\", \"'물'\", \"'물'\", \"'통후추'\", \"'다시마'\", \"'맛술'\", \"'맛술'\", \"'맛술'\", \"'맛술'\", \"'설탕'\", \"'설탕'\", \"'설탕'\", \"'설탕'\", \"'마늘'\", \"'무'\", \"'육류'\", \"'통마늘'\", \"'통마늘'\", \"'실고추'\", \"'실고추'\", \"'꽈리고추'\", \"'메추리알'\", \"'삶은계란'\", \"'홍두깨살'\", \"'말린표고'\"]>,\n",
       " <Record r.title='불고기솥밥' collect(i.name)=[\"'소고기'\", \"'다진마늘'\", \"'물'\", \"'다시마'\", \"'맛술'\", \"'설탕'\", \"'꿀'\", \"'후추'\", \"'쌀'\", \"'당근'\", \"'달걀노른자'\"]>,\n",
       " <Record r.title='소고기 카레 만들기 고형 카레 하우스 바몬드카레 아이들이 좋아하는 카레라이스 한 그릇 요리' collect(i.name)=[\"'소고기'\", \"'양파'\", \"'감자'\", \"'물'\", \"'식용유'\", \"'당근'\"]>]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:HAS_INGREDIENT]->(i:Ingredient)\n",
    "RETURN r.title, collect(i.name)\n",
    "LIMIT 5;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "8f63a2c7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record r.title='손님접대 요리  예비사위를 위한 상차림' c.name=\"'국'\">,\n",
       " <Record r.title='맑은 소고기무국 끓이는 법 아기 무국 레시피' c.name=\"'국'\">,\n",
       " <Record r.title='계란국 끓이는법 초간단 아기 순두부' c.name=\"'국'\">,\n",
       " <Record r.title='재첩국보다 시원하고 깔끔한 시금치 굴국 끓이기' c.name=\"'국'\">,\n",
       " <Record r.title='[굴국밥] 칼칼하고 맑은 국물 굴국밥 레시피' c.name=\"'국'\">]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:IN_CATEGORY]->(c:Category)\n",
    "RETURN r.title, c.name\n",
    "LIMIT 5;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "5c9cf513",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run('''MATCH (r:Recipe)-[:HAS_INGREDIENT]->(i:Ingredient)\n",
    "WHERE i.name = '대파'\n",
    "AND NOT EXISTS {\n",
    "  MATCH (r)-[:HAS_INGREDIENT]->(:Ingredient {name:'돼지고기'})\n",
    "}\n",
    "RETURN r.title, r.time_min\n",
    "LIMIT 10;''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e42b8b2f",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "fridge",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.19"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
